docs/bluedb/mutations/G0.5.second-go-build-site.patch
diff --git a/rust/crates/project/src/build.rs b/rust/crates/project/src/build.rs
index bb4b41d3..3518c560 100644
--- a/rust/crates/project/src/build.rs
+++ b/rust/crates/project/src/build.rs
@@ -2156,3 +2156,17 @@ mod materialise_rt_tests {
         let _ = fs::remove_dir_all(&root);
     }
 }
+
+// MUTATION (G0.5): a second `go build` invocation that does not inherit
+// `run_go_build_once`'s tags. This is exactly how the property regresses — the
+// sole-site check must report two sites.
+#[allow(dead_code)]
+fn mutation_second_go_build_site(out_dir: &Path) {
+    let _ = Command::new("go")
+        .arg("build")
+        .arg("-o")
+        .arg("app")
+        .arg(".")
+        .current_dir(out_dir)
+        .output();
+}
